
&НаКлиенте
Процедура ПродажиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Продажи.ТекущиеДанные;
	
	ПересчитатьСумму(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Продажи.ТекущиеДанные;
	
	ПересчитатьСумму(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСумму(ТекущиеДанные)
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.Сумма = ТекущиеДанные.Количество * ТекущиеДанные.Цена;
	КонецЕсли;
	
КонецПроцедуры
